{
  "Muffin in a Mug": {
    "Ingredients": [
      "4 tbsp self-raising flour",
      "4 tbsp caster sugar",
      "2 tbsp cocoa powder",
      "1 medium egg",
      "3 tbsp milk",
      "3 tbsp vegetable oil or sunflower oil",
      "a few drops of vanilla essence or other essence (orange or peppermint work well)",
      "2 tbsp chocolate chips, nuts, or raisins etc (optional)"
      ],
    "Steps": [
      "Add the flour, sugar and cocoa powder to the largest mug you have (to stop it overflowing in the microwave) and mix. Add the egg and mix in as much as you can, but don't worry if there's still dry mix left.",
      "Add the milk, oil and essence and mix until smooth, before adding the chocolate chips, nuts, or raisins, if using, and mixing again. Centre your mug in the middle of the microwave oven and cook on high for 1½ -2 mins, or until it has stopped rising and is firm to the touch. Don't forget to watch it rise as it cooks!"
    ]
  },
  "Simple Tuna Salad": {
    "Ingredients":[
      "1 can of tuna",
      "2 tablespoons mayonnaise",
      "1/8 teaspoon salt (more to taste)",
      "pinch of pepper",
      "small squeeze of lemon juice"
    ],
    "Steps":[
      "In a bowl, mix together the tuna, mayonnaise, salt, pepper and lemon juice until very well combined. (If your tuna is already salted in the can, taste it first before you add the salt. If the tuna is unsalted, you may need to add more salt. Adjust according to taste)",
      "(Optional) If making a sandwich, spread some mustard on both sides of a bun. Add the tuna, a slice of cheese and a lettuce leaf."
    ]
  }, 
  "Omelette in a mug": {
    "Ingredients":[
      "1 teaspoon Land O Lakes® Butter with Canola Oil",
      "2 large Land O Lakes® Eggs",
      "TOPPINGS (IF DESIRED)",
      "Shredded cheese",
      "Chopped onion",
      "Chopped bell pepper",
      "Chopped ham",
      "Salt",
      "Pepper"
    ],
    "Steps":[
      "Add 1 teaspoon butter 12- to 16-ounce microwave-safe coffee cup. Crack eggs into cup. Beat with fork until well mixed.",
      "Microwave 1 minute. Sprinkle with desired toppings. Microwave 30-60 seconds or until egg is cooked through. Season with salt and pepper, if desired."
    ]
  }, 
  "": {
    "Ingredients":[
      
    ],
    "Steps":[
      
    ]
  }
}